konf/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ВКМ_Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ВидыГрафиков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

konf/src/InformationRegisters/ВКМ_ДолжностиСотрудников/ВКМ_ДолжностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ДолжностиСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ВКМ_ДолжностиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

konf/src/Enums/ВКМ_КатегорииДолжности/ВКМ_КатегорииДолжности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииДолжности</name>
  <enumValues>
    <name>Специалисты</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

konf/src/Catalogs/ВКМ_ДолжностиСотрудников/ВКМ_ДолжностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_ДолжностиСотрудников</name>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорииДолжности</types>
    </type>
  </attributes>
</mdclass:Catalog>

konf/src/Documents/ВКМ_НачислениеЗаработнойПлаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТАБЛИЦЫФормыОсновныеНачисления

&НаКлиенте
Процедура ОсновныеНачисленияСотрудникПриИзменении(Элемент)
	ТекушиеДанные = Элементы.ОсновныеНачисления.ТекущиеДанные;  
	
	Массив = Новый Массив;
	Структура = Новый Структура;
	Структура.Вставить("Сотрудник", ТекушиеДанные.Сотрудник);
	Структура.Вставить("Подразделение", ТекушиеДанные.Подразделение);
	Структура.Вставить("ГрафикРаботы", ТекушиеДанные.ГрафикРаботы);  
	Структура.Вставить("ДатаНачала", ТекушиеДанные.ДатаНачала);
	Структура.Вставить("ДатаОкончания", ТекушиеДанные.ДатаОкончания); 
	Массив.Добавить(Структура);
	ОсновныеНачисленияСотрудникПриИзмененииНаСервере(Массив, Объект.Дата);
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПроверитьСотрудникаНаГруппуСпециалист(Сотрудник, Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ДолжностиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_ДолжностиСотрудниковСрезПоследних.Должность КАК Должность,
	|	ВКМ_ДолжностиСотрудниковСрезПоследних.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_Сотрудник
	|ИЗ
	|	РегистрСведений.ВКМ_ДолжностиСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ВКМ_ДолжностиСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудник.Сотрудник КАК Сотрудник,
	|	ВКМ_КатегорииДолжности.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВКМ_КатегорииДолжности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорииДолжности.Специалисты)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоСпециалист,
	|	ВТ_Сотрудник.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_Сотрудник КАК ВТ_Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_ДолжностиСотрудников КАК ВКМ_ДолжностиСотрудников
	|			ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ВКМ_КатегорииДолжности КАК ВКМ_КатегорииДолжности
	|			ПО ВКМ_ДолжностиСотрудников.Категория = ВКМ_КатегорииДолжности.Ссылка
	|		ПО ВТ_Сотрудник.Должность = ВКМ_ДолжностиСотрудников.Ссылка";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

&НаСервере
Процедура ОсновныеНачисленияСотрудникПриИзмененииНаСервере(Массив, Дата)
	
	Выборка_ЭтоСпециалист = ПроверитьСотрудникаНаГруппуСпециалист(Массив[0].Сотрудник, Дата);
	
	Если Выборка_ЭтоСпециалист.Следующий() Тогда 
		Выборка_ЭтоСпециалист.Следующий();
		ЭтоСпециалист = Выборка_ЭтоСпециалист.ЭтоСпециалист;
		
		Если ЭтоСпециалист Тогда
			
			Строка = Объект.ОсновныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Массив[0]);
			Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтВыполненыхРабот;
			
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", Массив[0].Сотрудник);
		НайденныеСтроки = Объект.ОсновныеНачисления.НайтиСтроки(Отбор);
		
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			
			Для Каждого Строка Из НайденныеСтроки Цикл
				
				Строка.Подразделение = Выборка_ЭтоСпециалист.Подразделение;	
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти
